use master
GO

IF DB_ID('decanat') IS NOT NULL
	begin
		DROP DATABASE decanat
	end

		CREATE DATABASE decanat
GO

use [decanat]
GO

CREATE TABLE Specialties (
	[ID] INT NOT NULL IDENTITY(1,1) PRIMARY KEY,
	[Code] NVARCHAR(8) NOT NULL,
	[Name] NVARCHAR(50) NOT NULL,
	[Education] NVARCHAR(20) NOT NULL,
	[Level] NVARCHAR(20) NOT NULL,
	[Duration of study] INT NOT NULL,
	[Description] NVARCHAR(100))

CREATE TABLE Groups (
	[ID] INT NOT NULL IDENTITY(1,1) PRIMARY KEY,
	[Name] NVARCHAR(50) NOT NULL,
	[Specialty] INT FOREIGN KEY REFERENCES Specialties(ID) NOT NULL,
	[Leader] INT NULL,
	[Curator] INT NULL)

CREATE TABLE Students (
	[Gradebook number] INT PRIMARY KEY NOT NULL,
	[Surname] NVARCHAR(30) NOT NULL,
	[First name] NVARCHAR(20) NOT NULL,
	[Patronymic] NVARCHAR(20),
	[ID_Group] INT FOREIGN KEY REFERENCES Groups(ID)  NOT NULL,
	[Year of entry] INT NOT NULL)

CREATE TABLE Teachers (
	[Number] INT PRIMARY KEY NOT NULL,
	[Surname] NVARCHAR(30) NOT NULL,
	[First name] NVARCHAR(20) NOT NULL,
	[Patronymic] NVARCHAR(20),
	[Academic degree] NVARCHAR(20) NOT NULL,
	[Academic title] NVARCHAR(20) NOT NULL,
	[Department] NVARCHAR(50) NOT NULL)

CREATE TABLE Subjects (
	[ID] INT NOT NULL IDENTITY(1,1) PRIMARY KEY,
	[Name]  NVARCHAR(80) NOT NULL,
	[Specialty] INT FOREIGN KEY REFERENCES Specialties(ID)  NOT NULL,
	[Semester] INT NOT NULL,
	[Amount of study] INT NOT NULL,
	[Examination] NVARCHAR(30))

CREATE TABLE Studying (
	[Gradebook number] INT NOT NULL FOREIGN KEY REFERENCES Students([Gradebook number]),
	[ID_Subject] INT FOREIGN KEY REFERENCES Subjects(ID) NOT NULL,
	[Date] Date NOT NULL,
	[Mark] NVARCHAR(20))

CREATE TABLE Teaching (
	[ID_Subject] INT FOREIGN KEY REFERENCES Subjects(ID) NOT NULL,
	[Number] INT FOREIGN KEY REFERENCES Teachers([Number]) NOT NULL)

INSERT INTO Specialties
	VALUES
	('09.03.01', 'Информатика и вычисительная техника', 'Очная', 'Бакалавриат', 2, '-'),
	('09.03.02', 'Информационные системы и технологии', 'Очная', 'Бакалавриат', 2, '-'),
	('10.03.01', 'Информационная безопасность', 'Заочная', 'Бакалавриат', 2, '-'),
	('27.03.03', 'Системный анализ и управление', 'Очная', 'Магистратура', 2, '-'),
	('09.03.04', 'Программная Инженерия', 'Очная', 'Бакалавриат', 2, '-')

INSERT INTO Groups
	VALUES 
	('КИ-22 08', 1, 1, 1),
	('КИ-22 07', 4, 8, 2),
	('КИ-22 06', 2, 15, 3),
	('КИ-22 15', 2, 22, 4)

INSERT INTO Students
	VALUES
--First group
	(1, 'Безпалый', 'Денис', 'Алексеевич', 1, 2022),
	(2, 'Беушев', 'Егор', 'Александрович', 1, 2022),
	(3, 'Болдырев', 'Андрей', 'Викторович', 1, 2022),
	(4, 'Вальков', 'Антон', 'Андреевич', 1, 2022),
	(5, 'Воронин', 'Тимофей', 'Викторович', 1, 2022),
	(6, 'Горбачев', 'Вячеслав', 'Евгеньевич', 1, 2022),
	(7, 'Елисеев', 'Василий', 'Андреевич', 1, 2022),

-- Вторая группа
	(8, 'Акчинова', 'Алина', 'Сергеевна', 2, 2022),
	(9, 'Анохина', 'Юлия', 'Владимировна', 2, 2022),
	(10, 'Брайнингер', 'Иван', 'Сергеевич', 2, 2022),
	(11, 'Егунько', 'Вадим', 'Андреевич', 2, 2022),
	(12, 'Колесников', 'Антон', 'Виталиевич', 2, 2022),
	(13, 'Темников', 'Павел', 'Алексеевич', 2, 2022),
	(14, 'Супереченко', 'Данила', 'Артурович', 2, 2022),

-- Третья группа
	(15, 'Астафьева', 'Ксения', 'Андреевна', 3, 2022),
	(16, 'Белан', 'Кристина', 'Максимовна', 3, 2022),
	(17, 'Борозна', 'Анна', 'Альбертовна', 3, 2022),
	(18, 'Замыслова', 'Светлана', 'Сергеевна', 3, 2022),
	(19, 'Рукосуева', 'Екатерина', 'Дмитриевна', 3, 2022),
	(20, 'Сайбель', 'Максим', 'Сергеевич', 3, 2022),
	(21, 'Никончук', 'Арина', 'Руслановна', 3, 2022),

-- Четвертая группа
	(22, 'Абагаев', 'Артём', 'Анатольевич', 4, 2022),
	(23, 'Амирова', 'Лаура', 'Нураддин', 4, 2022),
	(24, 'Бубенко', 'Андрей', 'Николаевич', 4, 2022),
	(25, 'Гавриков', 'Даниил', 'Денисович', 4, 2022),
	(26, 'Исочко', 'Ирина', 'Эдуардовна', 4, 2022),
	(27, 'Пирогов', 'Владислав', 'Алексеевич', 4, 2022),
	(28, 'Саутин', 'Алексей', 'Александрович', 4, 2022)

INSERT INTO Teachers
	VALUES
	(1, 'Титовская', 'Татьяна', 'Сергеевна', 'Доктор', 'Профессор', 'ИВТ'),
	(2, 'Гульнова', 'Белла', 'Владимировна', 'Кандидат', 'Доцент', 'ИВТ'),
	(3, 'Пушкарёв', 'Кирилл', 'Владимирович', 'Нет', 'Доцент', 'ИСИТ'),
	(4, 'Шадрин', 'Игорь', 'Владимирович', 'Кандидат', 'Доцент', 'САУ'),
	(5, 'Макуха', 'Любовь', 'Витальевна', 'Кандидат', 'Доцент', 'САУ')

INSERT INTO Subjects
	VALUES
--специальность 1
--семестр 1
	('Физика', 1, 1, 144, 'Экзамен'),
	('Дискретная математика', 1, 2, 144, 'Экзамен'),
	('Основы программирование', 1, 2, 96, 'Зачёт'),
	('История', 1, 1, 144, 'Зачёт'), 
	('Математический Анализ', 1, 2, 144, 'Зачёт'),
--семестр 2
	('Программирование', 1, 1, 96, 'Экзамен'),
	('Английский язык', 2, 2, 144, 'Экзамен'),
	('Компьютерные технологии в науке и производстве', 1, 2, 48, 'Зачёт'),
	('Деловая коммуникация в профессиональной деятельности', 1, 2, 48, 'Зачёт'),
	('Дискретная математика', 1, 2, 144, 'Зачёт'),

--специальность 2
--семестр 1
	('Математический Анализ', 2, 2, 96, 'Экзамен'),
	('Введение в профессиональную деятельность', 2, 1, 96, 'Экзамен'),
	('Физика', 2, 1, 48, 'Зачёт'),
	('История', 2, 2, 144, 'Зачёт'),
	('Компьютерное моделирование технологических процессов', 2, 1, 48, 'Зачёт'),
--семестр 2
	('Физика', 2, 1, 144, 'Экзамен'),
	('Инженерия', 2, 2, 96, 'Экзамен'),
	('Математический Анализ', 2, 1, 96, 'Зачёт'),
	('Введение в специальность', 2, 2, 96, 'Зачёт'),
	('Английский язык', 2, 2, 96, 'Зачёт'),

--специальность 3
--семестр 1
	('Технологические процессы машиностроительного производства', 3, 1, 96, 'Экзамен'),
	('Сети', 3, 1, 144, 'Экзамен'),
	('Технологическое оборудование самолетостроения', 3, 2, 96, 'Зачёт'),
	('Основы ОС', 3, 1, 96, 'Зачёт'),
	('Деловой иностранный язык', 3, 1, 96, 'Зачёт'),
--семестр 2
	('Автоматизация проектирования', 3, 1, 144, 'Зачёт'), 
	('Автоматизация проектирования', 3, 2, 144, 'Экзамен'),
	('Системы автоматизированного проектирования', 3, 2, 48, 'Зачёт'),
	('Промышленное оборудование автоматизированных производств', 3, 2, 48, 'Зачёт'),
	('Математическое моделирование и экономический анализ воздушных судов', 3, 2, 144, 'Экзамен')

-- Первая группа
INSERT INTO Studying
	VALUES
	(1, 1, '20.12.2023', 'Зачёт'),
	(2, 1, '20.12.2023', 'Зачёт'),
	(3, 1, '20.12.2023', 'Зачёт'),
	(4, 1, '20.12.2023', 'Зачёт'),
	(5, 1, '20.12.2023', 'Зачёт'),
	(6, 1, '20.12.2023', 'Зачёт'),
	(7, 1, '20.12.2023', 'Незачёт'),
	(1, 5, '20.12.2023', 'Зачёт'),
	(2, 5, '20.12.2023', 'Зачёт'),
	(3, 5, '20.12.2023', 'Незачёт'),
	(4, 5, '20.12.2023', 'Зачёт'),
	(5, 5, '20.12.2023', 'Зачёт'),
	(6, 5, '20.12.2023', 'Незачёт'),
	(7, 5, '20.12.2023', 'Незачёт'),
	(1, 6, '20.12.2023', 'Зачёт'),
	(2, 6, '20.12.2023', 'Зачёт'),
	(3, 6, '20.12.2023', 'Зачёт'),
	(4, 6, '20.12.2023', 'Незачёт'),
	(5, 6, '20.12.2023', 'Зачёт'),
	(6, 6, '20.12.2023', 'Зачёт'),
	(7, 6, '20.12.2023', 'Зачёт'),
	(1, 3, '21.12.2023', 'Отлично'),
	(2, 3, '21.12.2023', 'Удовлетворительно'),
	(3, 3, '21.12.2023', 'Хорошо'),
	(4, 3, '21.12.2023', 'Хорошо'),
	(5, 3, '21.12.2023', 'Хорошо'),
	(6, 3, '21.12.2023', 'Удовлетворительно'),
	(7, 3, '21.12.2023', 'Отлично'),
	(1, 7, '21.12.2023', 'Отлично'),
	(2, 7, '22.12.2023', 'Удовлетворительно'),
	(3, 7, '22.12.2023', 'Хорошо'),
	(4, 7, '22.12.2023', 'Хорошо'),
	(5, 7, '22.12.2023', 'Удовлетворительно'),
	(6, 7, '22.12.2023', 'Удовлетворительно'),
	(7, 7, '22.12.2023', 'Хорошо'),

	(1, 4, '10.06.2024', 'Зачёт'),
	(2, 4, '10.06.2024', 'Зачёт'),
	(3, 4, '10.06.2024', 'Незачёт'),
	(4, 4, '10.06.2024', 'Зачёт'),
	(5, 4, '10.06.2024', 'Зачёт'),
	(6, 4, '10.06.2024', 'Зачёт'),
	(7, 4, '10.06.2024', 'Зачёт'),
	(1, 8, '10.06.2024', 'Зачёт'),
	(2, 8, '10.06.2024', 'Зачёт'),
	(3, 8, '10.06.2024', 'Незачёт'),
	(4, 8, '10.06.2024', 'Зачёт'),
	(5, 8, '10.06.2024', 'Зачёт'),
	(6, 8, '10.06.2024', 'Незачёт'),
	(7, 8, '10.06.2024', 'Зачёт'),
	(1, 9, '10.06.2024', 'Зачёт'),
	(2, 9, '10.06.2024', 'Зачёт'),
	(3, 9, '10.06.2024', 'Зачёт'),
	(4, 9, '10.06.2024', 'Незачёт'),
	(5, 9, '10.06.2024', 'Зачёт'),
	(6, 9, '10.06.2024', 'Зачёт'),
	(7, 9, '10.06.2024', 'Зачёт'),
	(1, 2, '11.06.2024', 'Отлично'),
	(2, 2, '11.06.2024', 'Удовлетворительно'),
	(3, 2, '11.06.2024', 'Хорошо'),
	(4, 2, '11.06.2024', 'Хорошо'),
	(5, 2, '11.06.2024', 'Хорошо'),
	(6, 2, '11.06.2024', 'Удовлетворительно'),
	(7, 2, '11.06.2024', 'Отлично'),
	(1, 10, '12.06.2024', 'Отлично'),
	(2, 10, '12.06.2024', 'Удовлетворительно'),
	(3, 10, '12.06.2024', 'Хорошо'),
	(4, 10, '12.06.2024', 'Хорошо'),
	(5, 10, '12.06.2024', 'Удовлетворительно'),
	(6, 10, '12.06.2024', 'Удовлетворительно'),
	(7, 10, '12.06.2024', 'Хорошо')

-- Вторая группа
INSERT INTO Studying
	VALUES
	(8, 21, '20.12.2023', 'Зачёт'),
	(9, 21, '20.12.2023', 'Зачёт'),
	(10, 21, '20.12.2023', 'Зачёт'),
	(11, 21, '20.12.2023', 'Зачёт'),
	(12, 21, '20.12.2023', 'Зачёт'),
	(13, 21, '20.12.2023', 'Зачёт'),
	(14, 21, '20.12.2023', 'Незачёт'),
	(8, 25, '20.12.2023', 'Зачёт'),
	(9, 25, '20.12.2023', 'Зачёт'),
	(10, 25, '20.12.2023', 'Незачёт'),
	(11, 25, '20.12.2023', 'Зачёт'),
	(12, 25, '20.12.2023', 'Зачёт'),
	(13, 25, '20.12.2023', 'Незачёт'),
	(14, 25, '20.12.2023', 'Незачёт'),
	(8, 26, '20.12.2023', 'Зачёт'),
	(9, 26, '20.12.2023', 'Зачёт'),
	(10, 26, '20.12.2023', 'Зачёт'),
	(11, 26, '20.12.2023', 'Зачёт'),
	(12, 26, '20.12.2023', 'Зачёт'),
	(13, 26, '20.12.2023', 'Зачёт'),
	(14, 26, '20.12.2023', 'Незачёт'),
	(8, 23, '21.12.2023', 'Отлично'),
	(9, 23, '21.12.2023', 'Удовлетворительно'),
	(10, 23, '21.12.2023', 'Хорошо'),
	(11, 23, '21.12.2023', 'Хорошо'),
	(12, 23, '21.12.2023', 'Хорошо'),
	(13, 23, '21.12.2023', 'Удовлетворительно'),
	(14, 23, '21.12.2023', 'Отлично'),
	(8, 27, '22.12.2023', 'Отлично'),
	(9, 27, '22.12.2023', 'Удовлетворительно'),
	(10, 27, '22.12.2023', 'Хорошо'),
	(11, 27, '22.12.2023', 'Хорошо'),
	(12, 27, '22.12.2023', 'Неудовлетворительно'),
	(13, 27, '22.12.2023', 'Удовлетворительно'),
	(14, 27, '22.12.2023', 'Хорошо'),

	(8, 24, '10.06.2024', 'Зачёт'),
	(9, 24, '10.06.2024', 'Зачёт'),
	(10, 24, '10.06.2024', 'Зачёт'),
	(11, 24, '10.06.2024', 'Зачёт'),
	(12, 24, '10.06.2024', 'Зачёт'),
	(13, 24, '10.06.2024', 'Зачёт'),
	(14, 24, '10.06.2024', 'Незачёт'),
	(8, 28, '10.06.2024', 'Зачёт'),
	(9, 28, '10.06.2024', 'Зачёт'),
	(10, 28, '10.06.2024', 'Незачёт'),
	(11, 28, '10.06.2024', 'Зачёт'),
	(12, 28, '10.06.2024', 'Зачёт'),
	(13, 28, '10.06.2024', 'Незачёт'),
	(14, 28, '10.06.2024', 'Незачёт'),
	(8, 29, '10.06.2024', 'Зачёт'),
	(9, 29, '10.06.2024', 'Зачёт'),
	(10, 29, '10.06.2024', 'Зачёт'),
	(11, 29, '10.06.2024', 'Зачёт'),
	(12, 29, '10.06.2024', 'Зачёт'),
	(13, 29, '10.06.2024', 'Зачёт'),
	(14, 29, '10.06.2024', 'Незачёт'),
	(8, 22, '11.06.2024', 'Отлично'),
	(9, 22, '11.06.2024', 'Удовлетворительно'),
	(10, 22, '11.06.2024', 'Хорошо'),
	(11, 22, '11.06.2024', 'Хорошо'),
	(12, 22, '11.06.2024', 'Хорошо'),
	(13, 22, '11.06.2024', 'Удовлетворительно'),
	(14, 22, '11.06.2024', 'Отлично'),
	(8, 30, '12.06.2024', 'Отлично'),
	(9, 30, '12.06.2024', 'Удовлетворительно'),
	(10, 30, '12.06.2024', 'Хорошо'),
	(11, 30, '12.06.2024', 'Хорошо'),
	(12, 30, '12.06.2024', 'Удовлетворительно'),
	(13, 30, '12.06.2024', 'Удовлетворительно'),
	(14, 30, '12.06.2024', 'Хорошо')

-- Третья группа
INSERT INTO Studying
	VALUES
	(15, 11, '20.12.2023', 'Зачёт'),
	(16, 11, '20.12.2023', 'Зачёт'),
	(17, 11, '20.12.2023', 'Зачёт'),
	(18, 11, '20.12.2023', 'Зачёт'),
	(19, 11, '20.12.2023', 'Незачёт'),
	(20, 11, '20.12.2023', 'Зачёт'),
	(21, 11, '20.12.2023', 'Незачёт'),
	(15, 14, '20.12.2013', 'Зачёт'),
	(16, 14, '20.12.2013', 'Зачёт'),
	(17, 14, '20.12.2013', 'Зачёт'),
	(18, 14, '20.12.2013', 'Зачёт'),
	(19, 14, '20.12.2023', 'Незачёт'),
	(20, 14, '20.12.2023', 'Зачёт'),
	(21, 14, '20.12.2023', 'Незачёт'),
	(15, 16, '20.12.2023', 'Зачёт'),
	(16, 16, '20.12.2023', 'Зачёт'),
	(17, 16, '20.12.2023', 'Зачёт'),
	(18, 16, '20.12.2023', 'Зачёт'),
	(19, 16, '20.12.2023', 'Незачёт'),
	(20, 16, '20.12.2023', 'Зачёт'),
	(21, 16, '20.12.2023', 'Незачёт'),
	(15, 15, '21.12.2023', 'Отлично'),
	(16, 15, '21.12.2023', 'Удовлетворительно'),
	(17, 15, '21.12.2023', 'Хорошо'),
	(18, 15, '21.12.2023', 'Хорошо'),
	(19, 15, '21.12.2023', 'Хорошо'),
	(20, 15, '21.12.2023', 'Удовлетворительно'),
	(21, 15, '21.12.2023', 'Отлично'),
	(15, 17, '22.12.2023', 'Отлично'),
	(16, 17, '22.12.2023', 'Удовлетворительно'),
	(17, 17, '22.12.2023', 'Хорошо'),
	(18, 17, '22.12.2023', 'Хорошо'),
	(19, 17, '22.12.2023', 'Удовлетворительно'),
	(20, 17, '22.12.2023', 'Удовлетворительно'),
	(21, 17, '22.12.2023', 'Хорошо'),	

	(15, 13, '10.06.2024', 'Зачёт'),
	(16, 13, '10.06.2024', 'Зачёт'),
	(17, 13, '10.06.2024', 'Зачёт'),
	(18, 13, '10.06.2024', 'Зачёт'),
	(19, 13, '10.06.2024', 'Зачёт'),
	(20, 13, '10.06.2024', 'Зачёт'),
	(21, 13, '10.06.2024', 'Незачёт'),
	(15, 18, '10.06.2024', 'Зачёт'),
	(16, 18, '10.06.2024', 'Зачёт'),
	(17, 18, '10.06.2024', 'Незачёт'),
	(18, 18, '10.06.2024', 'Зачёт'),
	(19, 18, '10.06.2024', 'Зачёт'),
	(20, 18, '10.06.2024', 'Незачёт'),
	(21, 18, '10.06.2024', 'Незачёт'),
	(15, 19, '10.06.2024', 'Зачёт'),
	(16, 19, '10.06.2024', 'Зачёт'),
	(17, 19, '10.06.2024', 'Зачёт'),
	(18, 19, '10.06.2024', 'Зачёт'),
	(19, 19, '10.06.2024', 'Зачёт'),
	(20, 19, '10.06.2024', 'Зачёт'),
	(21, 19, '10.06.2024', 'Незачёт'),
	(15, 12, '11.06.2024', 'Отлично'),
	(16, 12, '11.06.2024', 'Удовлетворительно'),
	(17, 12, '11.06.2024', 'Хорошо'),
	(18, 12, '11.06.2024', 'Хорошо'),
	(19, 12, '11.06.2024', 'Хорошо'),
	(20, 12, '11.06.2024', 'Удовлетворительно'),
	(21, 12, '11.06.2024', 'Отлично'),
	(15, 20, '12.06.2024', 'Отлично'),
	(16, 20, '12.06.2024', 'Удовлетворительно'),
	(17, 20, '12.06.2024', 'Хорошо'),
	(18, 20, '12.06.2024', 'Хорошо'),
	(19, 20, '12.06.2024', 'Удовлетворительно'),
	(20, 20, '12.06.2024', 'Удовлетворительно'),
	(21, 20, '12.06.2024', 'Хорошо')

-- Четвертая группа
INSERT INTO Studying
	VALUES
	(22, 11, '20.12.2023', 'Зачёт'),
	(23, 11, '20.12.2023', 'Зачёт'),
	(24, 11, '20.12.2023', 'Зачёт'),
	(25, 11, '20.12.2023', 'Зачёт'),
	(26, 11, '20.12.2023', 'Незачёт'),
	(27, 11, '20.12.2023', 'Зачёт'),
	(28, 11, '20.12.2023', 'Незачёт'),
	(22, 14, '20.12.2023', 'Зачёт'),
	(23, 14, '20.12.2023', 'Зачёт'),
	(24, 14, '20.12.2023', 'Зачёт'),
	(25, 14, '20.12.2023', 'Зачёт'),
	(26, 14, '20.12.2023', 'Незачёт'),
	(27, 14, '20.12.2023', 'Зачёт'),
	(28, 14, '20.12.2023', 'Незачёт'),
	(22, 16, '20.12.2023', 'Зачёт'),
	(23, 16, '20.12.2023', 'Зачёт'),
	(24, 16, '20.12.2023', 'Зачёт'),
	(25, 16, '20.12.2023', 'Зачёт'),
	(26, 16, '20.12.2023', 'Незачёт'),
	(27, 16, '20.12.2023', 'Зачёт'),
	(28, 16, '20.12.2023', 'Незачёт'),
	(22, 15, '21.12.2023', 'Отлично'),
	(23, 15, '21.12.2023', 'Удовлетворительно'),
	(24, 15, '21.12.2023', 'Хорошо'),
	(25, 15, '21.12.2023', 'Хорошо'),
	(26, 15, '21.12.2023', 'Хорошо'),
	(27, 15, '21.12.2023', 'Удовлетворительно'),
	(28, 15, '21.12.2023', 'Отлично'),
	(22, 17, '22.12.2023', 'Отлично'),
	(23, 17, '22.12.2023', 'Удовлетворительно'),
	(24, 17, '22.12.2023', 'Хорошо'),
	(25, 17, '22.12.2023', 'Хорошо'),
	(26, 17, '22.12.2023', 'Удовлетворительно'),
	(27, 17, '22.12.2023', 'Удовлетворительно'),
	(28, 17, '22.12.2023', 'Хорошо'),

	(22, 13, '10.06.2024', 'Зачёт'),
	(23, 13, '10.06.2024', 'Зачёт'),
	(24, 13, '10.06.2024', 'Незачёт'),
	(25, 13, '10.06.2024', 'Зачёт'),
	(26, 13, '10.06.2024', 'Зачёт'),
	(27, 13, '10.06.2024', 'Зачёт'),
	(28, 13, '10.06.2024', 'Незачёт'),
	(22, 18, '10.06.2024', 'Зачёт'),
	(23, 18, '10.06.2024', 'Зачёт'),
	(24, 18, '10.06.2024', 'Незачёт'),
	(25, 18, '10.06.2024', 'Зачёт'),
	(26, 18, '10.06.2024', 'Зачёт'),
	(27, 18, '10.06.2024', 'Незачёт'),
	(28, 18, '10.06.2024', 'Незачёт'),
	(22, 19, '10.06.2024', 'Зачёт'),
	(23, 19, '10.06.2024', 'Зачёт'),
	(24, 19, '10.06.2024', 'Зачёт'),
	(25, 19, '10.06.2024', 'Зачёт'),
	(26, 19, '10.06.2024', 'Зачёт'),
	(27, 19, '10.06.2024', 'Зачёт'),
	(28, 19, '10.06.2024', 'Незачёт'),
	(22, 12, '11.06.2024', 'Отлично'),
	(23, 12, '11.06.2024', 'Удовлетворительно'),
	(24, 12, '11.06.2024', 'Хорошо'),
	(25, 12, '11.06.2024', 'Хорошо'),
	(26, 12, '11.06.2024', 'Хорошо'),
	(27, 12, '11.06.2024', 'Удовлетворительно'),
	(28, 12, '11.06.2024', 'Отлично'),
	(22, 20, '12.06.2024', 'Отлично'),
	(23, 20, '12.06.2024', 'Удовлетворительно'),
	(24, 20, '12.06.2024', 'Хорошо'),
	(25, 20, '12.06.2024', 'Хорошо'),
	(26, 20, '12.06.2024', 'Удовлетворительно'),
	(27, 20, '12.06.2024', 'Удовлетворительно'),
	(28, 20, '12.06.2024', 'Хорошо')

INSERT INTO Teaching
	VALUES
	(1, 5),
	(2,	4),
	(3, 3),
	(4, 2),
	(5, 1)

ALTER TABLE Groups
	ADD FOREIGN KEY (Leader) REFERENCES Students([Gradebook number]);
ALTER TABLE Groups
	ADD FOREIGN KEY (Curator) REFERENCES Teachers([Number]);
	GO

SELECT * FROM Groups
SELECT * FROM Specialties
SELECT * FROM Students
SELECT * FROM Studying
SELECT * FROM Subjects
SELECT * FROM Teachers
SELECT * FROM Teaching